Repository: pg008/projekt-tomo
Catalog: web/locale/*/LC_MESSAGES/django.po
Languages: sl

source: Problem descriptions and official solutions are hidden
sl: Besedilo nalog in uradne rešitve so skrite

source: Official solutions are hidden
sl: Uradne rešitve so skrite

source: Official solutions are visible when solved
sl: Uradne rešitve so vidne po sprejeti rešitvi

source: Official solutions are visible
sl: Uradne rešitve so vidne

source: Title
sl: Naslov

source: Description
sl: Opis

source: Visible
sl: Vidno

source: Solution visibility
sl: Vidnost rešitev

source: Project Tomo
sl: Projekt Tomo

source: (logout)
sl: (odjava)

source: Help
sl: Pomoč

source: Terms of service
sl: Pogoji poslovanja

source: Contact
sl: Kontakt

source: Copyright &copy; Faculty of Mathematics and Physics, University of Ljubljana, 2015. All Rights Reserved.
sl: Copyright &copy; Fakulteta za matematiko in fiziko, Univerza v Ljubljani, 2015. Vse pravice pridržane.

source: Taught course
sl: Predmet učite

source: Remove from my courses
sl: Odstrani iz mojih predmetov

source: Add to my courses
sl: Dodaj med moje predmete

source: valid
sl: veljavno

source: invalid
sl: neveljavno

source: empty
sl: prazno

source: Problem set is visible
sl: Sklop je viden

source: Problem set is hidden
sl: Sklop je skrit

source: Problem descriptions are hidden
sl: Besedila nalog so skrita

source: Edit
sl: Uredi

source: Delete
sl: Izbriši

source: Move
sl: Premakni

source: (current)
sl: (tukaj)

source: This couse does not have any problems yet. Please wait for a teacher to add some.
sl: Ta sklop še nima nobenih problemov. Prosimo počakajte, da jih učitelj doda.

source: Add new problem set
sl: Dodaj sklop

source: Demote to student
sl: Status študenta

source: Stop observing
sl: Nehaj opazovati

source: Promote to teacher
sl: Status učitelja

source: Course groups
sl: Skupine

source: Add new course group
sl: Dodaj novo skupino

source: Are you sure you want to delete this course group?
sl: Ste prepričani, da želite pobrisati to skupino?

source: Yes
sl: Da

source: No
sl: Ne

source: Edit course group
sl: Uredi skupino

source: Add
sl: Dodaj

source: Cancel
sl: Prekliči

source: Copy problem
sl: Kopiraj nalogo

source: Please choose a problem set to copy this problem to:
sl: Prosimo, izberite sklop, v katerega bo prekopirana ta naloga.

source: Copy
sl: Kopiraj

source: Download
sl: Prenesi

source: Student files
sl: Datoteke za učence

source: Teacher files
sl: Datoteke za učitelje

source: LaTeX files
sl: LaTeX datoteke

source: Files with results
sl: Datoteke z rezultati

source: Download all problem files
sl: Prenesi vse datoteke z nalogami

source: File for solving
sl: Datoteka za reševanje

source: File for editing
sl: Datoteka za urejanje

source: Solutions
sl: Rešitve

source: Move up
sl: Premakni gor

source: Move down
sl: Premakni dol

source: Update
sl: Posodobi

source: Download this problem file
sl: Datoteka z nalogo

source: part
sl: podnaloga

source: Add new problem
sl: Dodaj nalogo

source: Progress
sl: Napredek

source: Delete problem set
sl: Brisanje sklopa

source: Are you sure you want to delete problem set
sl: Ste prepričani, da želite pobrisati sklop

source: Edit problem set
sl: Uredi sklop

source: Help (Students)
sl: Navodila za učence

source: Using the system
sl: Delo v sistemu

source: You may sign in with Facebook, Google or Twitter account, or with the username and password you have received.
sl: V sistem se prijavimo preko Facebook, Google ali Twitter računa oziroma z uporabniškim imenom in geslom, ki nam je bilo dodeljeno.

source: After successful login a list of courses appears. On the top are the starred courses. This means the teacher can examine your submissions. These courses are marked with
sl: Po uspešni prijavi se nam pokaže seznam predmetov, ki so v sistemu. Na vrhu seznama vidimo predmete, ki smo jih že dodali med priljubljene. To pomeni, da je naše ime na seznamu udeležencev (učencev) in da učitelj predmeta lahko pregleduje naše rešitve nalog. Predmeti, ki smo jih dodali na seznam priljubljenih, so označeni z

source: You can pin a course by pressing
sl: Predmet dodamo med priljubljene s klikom na

source: Shown are the last three problem sets of each starred course. The percentage of accepted submissions is indicated next to the problem sets.
sl: Pri predmetih, v katere smo že vpisani, vidimo zadnje tri sklope. Poleg vsakega sklopa je zabeleženo, kolikšen delež nalog v tem sklopu smo že rešili tako, da so naše rešitve sprejete.

source: Courses, problem sets and problems
sl: Predmeti, sklopi in naloge

source: Upon opening a course, you are presented with a list of problem sets. A problem set usually encompasses similar problems. At the top of each problem set there is an introductory text about the discussed concepts, followed by the problems. Problems are independent and contain one or more corellated subproblems, that usually build upon each other and increase in difficulty.
sl: Ko odpremo predmet, vidimo seznam sklopov nalog. Sklopi ponavadi zajemajo naloge podobne sorte. Ko odpremo sklop, najprej vidimo uvodno besedilo, v katerem so običajno razloženi osnovni ukazi, obravnavani v sklopu, temu pa sledijo posamezne naloge. Naloge so med seboj neodvisne, vsaka pa je sestavljena iz ene ali več podnalog, ki običajno gradijo ena na drugi in so postopoma težje.

source: Solving the problems
sl: Reševanje nalog

source: Download the desired problem by pressing
sl: Izberemo nalogo, ki jo želimo reševati in s strežnika s klikom na gumb

source: You may also download the entire set as a ZIP file with
sl: prenesemo Python datoteko na svoj računalnik. Če želimo, lahko s klikom na gumb prenesemo tudi ZIP datoteko, ki vsebuje datoteke vseh nalog v ustreznem sklopu:

source: A problem file is an ordinary Python file containing commented instructions. Instructions are separated with a blank space where you can write the solution code.
sl: V datoteki je besedilo naloge in podnalog, zapisano kot komentar. Med besedilom je prazen prostor, v katerega bomo vpisali rešitve.

source: After writing down the solution, run the file (in IDLE this is achieved by pressing Run or pressing F5). This fires the tests written by the teacher and checks whether your solution is correct. Test results are then displayed in the command shell.
sl: Ko rešitve vpišemo v datoteko, datoteko poženemo (v IDLE s klikom na Run oziroma s klikom na F5). Ob zagonu se s pomočjo testov, ki jih je v naprej pripravil učitelj, preveri pravilnost naloge. Rezultati testov se bodo izpisali v ukazni lupini.

source: The solution is stored on the server each time you run the file, regardless of its validity. This means you can continue working on the problem on another device. After logging-in and downloading the files, the file will also contain your partial solutions.
sl: Ko datoteko poženemo, se naše rešitve shranijo na strežnik - ne glede na pravilnost. To pomeni, da reševanje lahko nadaljujemo kasneje, na drugem računalniku. Ko se bomo ponovno prijavili v sistem in prenesli datoteko z že reševano nalogo, bodo v datoteki tudi naše rešitve.

source: Displaying solutions and progress
sl: Ogled rešitev in napredka

source: After pressing
sl: Svoje rešitve določene naloge vidimo, če kliknemo na gumb

source: next to problem title, your solutions are displayed on the left and official solutions on the right.
sl: ob imenu naloge. Odpre se nam nova stran, kjer so na levi strani zaslona prikazane naše rešitve, na desni pa rešitve tistega, ki je nalogo sestavil.

source: The teacher decides which official solutions are visible. They may also decide that the official solutions are shown:
sl: Vidnost uradnih rešitev določa učitelj predmeta. Skrbnik lahko določi, da uradne rešitve vidimo:

source: always, even if your solution is incorrect (as in the image above),
sl: tudi, če naša rešitev ni sprejeta (kot na zgornji sliki),

source: only after your solution has been accepted (most common option) or
sl: po tem, ko je naša rešitve sprejeta (najpogosteje) ali

source: never.
sl: v nobenem primeru.

source: When your solution is accepted a green icon appears. If your attempted solution in invalid, a red icon appears. This way you can easily see which subproblems are yet to be solved.
sl: Ko je naša rešitev podnaloge sprejeta, se ob naslovu podnaloge izriše zelena ikona. Če smo podnalogo poskusili reševati, vendar rešitev ni pravilna, se izriše rdeča ikona. Tako na prvi pogled vidimo, katere podnaloge moramo še rešiti.

source: The problem title is also coloured based on the number of solved subproblems:
sl: Tudi naslov naloge se bo obarval glede na rešenost podnalog:

source: Gray, untill the first submission.
sl: Dokler nismo oddali nobene podnaloge, bo naslov sive barve.

source: Red, if one of the subproblems is solved incorrectly.
sl: Če je ena od podnalog rešena nepravilno, se ozadje naslova naloge obarva rdeče (kot na zgornji sliki).

source: Yellow, if all up to now submitted subproblems are valid.
sl: Če še nismo rešili vseh podnalog, že rešene pa so sprejete, bo naslov naloge obarvan rumeno.

source: Green, if all subproblem solutions are valid.
sl: Ko so sprejete rešitve vseh podnalog, se ozadje naslova naloge obarva zeleno.

source: Delete problem
sl: Brisanje naloge

source: Are you sure you want to delete problem
sl: Ste prepričani, da želite pobrisati nalogo

source: Edit problem
sl: Uredi nalogo

source: solutions
sl: rešitve

source: Your solution
sl: Vaša rešitev

source: Last submission time:
sl: Čas zadnje oddaje:

source: You did not attempt to solve this part.
sl: Tega dela naloge niste poskušali reševati.

source: Official solution
sl: Uradna rešitev

source: Official solutions are hidden.
sl: Uradne rešitve so skrite.

source: Official solution will be visible once you submit a valid solution.
sl: Uradne rešitve bodo vidne, ko boste oddali veljavno rešitev.

source: Sign in
sl: Prijavite se

source: Login with an external provider
sl: Prijavite se z zunanjim ponudnikom

source: You can login using one of the external providers listed above. We recommend that Slovene students and teachers use <a href="https://aai.arnes.si">ArnesAAI</a> single sign-on service.
sl: Prijavite se lahko z enim od zgoraj naštetih zunanjih ponudnikov. Slovenskim učencem in učiteljem priporočamo, da uporabijo enotno prijavo <a href="https://aai.arnes.si">ArnesAAI</a>.

source: By logging in you agree to our <a href="%(terms_of_service_url)s">Terms of service</a>. Our website uses cookies.
sl: S prijavo se strinjate z našimi <a href="%(terms_of_service_url)s">Pogoji poslovanja</a>. Spletna stran za delovanje uporablja piškotke.

source: Your personal programming teacher.
sl: Vaš osebni učitelj programiranja.

source: Sponsors
sl: Sponzorji

source: This work was funded in part by the European Union, European Regional Development Fund and the Ministry of Education, Science and Sport. The operation is implemented in the framework of the Operational Program for Strengthening Regional Development Potentials for the Period 2007 – 2013, Development priority: Economic development infrastructure, Priority theme: Information society.
sl: Operacijo je delno financirala Evropska unija iz Evropskega sklada za regionalni razvoj ter Ministrstvo za izobraževanje, znanost in šport. Operacija se izvaja v okviru Operativnega programa krepitve regionalnih razvojnih potencialov v obdobju 2007&mdash;2013, razvojne prioritete: gospodarska razvojna infrastruktura; prednostne usmeritve: informacijska družba
